a5021/stm32-async-1wire/src/ds18b20.c
#include "ds18b20.h"
#include "macro.h"
#include "stm32f1xx.h"
#ifndef HOST_BUILD
#include "app.h"
// Search diagnostics. WARNING: keep this DISABLED on real hardware. Each
// per-operation print is a blocking UART write of ~100-200µs between the merged
// search slots; the DS18B20's slot timer keeps running during that gap and
// samples the bus state, so the write-1 direction bits get misread as 0 and the
// device search drops sensors (observed: 5 real devices found with DIAG off,
// but only 2 of them survive with DIAG on). If diagnostics are needed, buffer
// the values in RAM and dump them after the search completes.
// #define DS18B20_SEARCH_DIAG
#endif

/**
 * @defgroup DS18B20_Private_Types DS18B20 Private Types
 * @{
 */

/**
 * @defgroup DS18B20_Private_Constants DS18B20 Private Constants
 * @{
 */

/** @brief Timer configuration for 1µs resolution (PSC = SYSCLK / 1MHz - 1) */
#ifdef HSI_8MHZ
#define TIM_PRESCALER 7 // 8MHz / 8 = 1MHz → 1µs/tick
#else
#define TIM_PRESCALER 71 // 72MHz / 72 = 1MHz → 1µs/tick
#endif
/** @brief Minimum reset pulse duration in microseconds */
#define RESET_PULSE_MIN 480U
/** @brief Maximum reset pulse duration in microseconds */
#define RESET_PULSE_MAX 540U
/** @brief Minimum presence pulse positive width in microseconds */
#define POSITIVE_WIDTH_MIN 15U
/** @brief Maximum presence pulse positive width in microseconds */
#define POSITIVE_WIDTH_MAX 60U
/** @brief Minimum presence pulse negative width in microseconds */
#define NEGATIVE_WIDTH_MIN 60U
/** @brief Maximum presence pulse negative width in microseconds */
#define NEGATIVE_WIDTH_MAX 240U
/** @brief Calculated minimum presence pulse timing */
#define PRESENCE_PULSE_MIN (RESET_PULSE_MIN + POSITIVE_WIDTH_MIN + NEGATIVE_WIDTH_MIN)
/** @brief Calculated maximum presence pulse timing */
#define PRESENCE_PULSE_MAX (RESET_PULSE_MAX + POSITIVE_WIDTH_MAX + NEGATIVE_WIDTH_MAX)
/** @brief Duration to drive bus low during reset in microseconds */
#define RESET_PULSE_DURATION RESET_PULSE_MIN
/** @brief Total reset timeslot timeout in microseconds */
#define RESET_TIMEOUT (RESET_PULSE_MIN * 2)
/** @brief CRC8 polynomial for DS18B20 scratchpad validation (Dallas/Maxim algorithm) */
#define DS18B20_CRC8_POLY 0x8C
/** @brief Number of bytes to include in CRC calculation */
#define DS18B20_CRC8_BYTES 8
/** @brief Size of edge capture buffer for presence detection */
#define CAPTURE_BUF_SIZE 2
/** @brief Duration of '1' bit pulse in microseconds */
#define ONE_PULSE 5
/** @brief Duration of '0' bit pulse in microseconds */
#define ZERO_PULSE 60
/** @brief Guard band between slots to prevent overlap due to bus rise time and DMA latency */
#define GUARD_BAND 5
/** @brief Total length of DS18B20 scratchpad in bytes */
#define DS18B20_SCRATCHPAD_LEN 9
/** @brief Total number of bits in DS18B20 scratchpad */
#define DS18B20_SCRATCHPAD_BITS (DS18B20_SCRATCHPAD_LEN * DS18B20_BITS_PER_BYTE)
/** @brief Total number of bits in a device ROM address */
#define DS18B20_ROM_BITS (DS18B20_ROM_BYTES * DS18B20_BITS_PER_BYTE)
/** @brief Total slots for Match ROM + 8-byte ROM + command */
#define DS18B20_MATCH_SLOTS ((DS18B20_ROM_BYTES + 2) * DS18B20_BITS_PER_BYTE)
/** @brief Slots for the invariant Match ROM + 8-byte ROM prefix (built on select) */
#define DS18B20_PREFIX_SLOTS ((DS18B20_ROM_BYTES + 1) * DS18B20_BITS_PER_BYTE)
/** @brief Threshold to distinguish short/long pulses (10µs) */
#define SHORT_PULSE_MAX 10U
/** @brief Number of DMA transfers for command transmission (2 bytes × 8 bits) */
#define DS18B20_DMA_TRANSFERS (2 * DS18B20_BITS_PER_BYTE)
/** @brief DMA channel control bits for 16-bit capture: MINC | PSIZE_0 | EN */
#define DS18B20_DMA_CCR_CAPTURE (DMA_CCR_MINC | DMA_CCR_PSIZE_0 | DMA_CCR_EN)
/** @brief Timer configuration for wait and pause (ARR, RCR) — 62500 ticks @ 1µs = 62.5ms per period */
#define PAUSE_750MS 62500, 11 /**< 750ms delay for temperature conversion (62.5ms × 12) */
#define PAUSE_5S 62500, 79 /**< 5s pause between measurement cycles (62.5ms × 80) */
/** @brief TH byte written together with the config register by the resolution
 *         state machine (Write Scratchpad requires TH + TL + CFG in one go).
 *         0 disables the alarm trigger threshold. */
#define DS18B20_RES_TH 0x00
/** @brief TL byte written together with the config register by the resolution
 *         state machine. 0 disables the alarm trigger threshold. */
#define DS18B20_RES_TL 0x00
/** @brief Bytes in the resolution config write for Skip ROM mode
 *         (Skip ROM 0xCC + Write Scratchpad 0x4E + TH + TL + CFG) */
#define DS18B20_RES_BYTES_MIN (1 + 1 + 3)
/** @brief Bytes in the resolution config write for Match ROM mode
 *         (Match ROM 0x55 + 8-byte ROM + 0x4E + TH + TL + CFG) */
#define DS18B20_RES_BYTES_MAX (1 + DS18B20_ROM_BYTES + 1 + 3)
/** @brief Slots for the Skip ROM resolution config write */
#define DS18B20_RES_SLOTS_MIN (DS18B20_RES_BYTES_MIN * DS18B20_BITS_PER_BYTE)
/** @brief Slots for the Match ROM resolution config write */
#define DS18B20_RES_SLOTS_MAX (DS18B20_RES_BYTES_MAX * DS18B20_BITS_PER_BYTE)

/**
 * @brief Convert byte bit to pulse duration (ONE_PULSE µs for '1', ZERO_PULSE µs for '0')
 * @param B Byte value
 * @param N Bit position (0-7)
 * @return Pulse duration in microseconds
 */
#define B2P(B, N) (((B) & (1 << (N))) ? ONE_PULSE : ZERO_PULSE)

/**
 * @brief Convert entire byte to sequence of pulse durations for transmission
 * @param B Byte value to convert
 */
#define BYTE_TO_PULSES(B)                       \
    B2P(B, 0), B2P(B, 1), B2P(B, 2), B2P(B, 3), \
        B2P(B, 4), B2P(B, 5), B2P(B, 6), B2P(B, 7)

/** @brief DS18B20 Convert T command sequence in pulse duration format */
static const uint8_t conv_cmd[] = {BYTE_TO_PULSES(0xCC), BYTE_TO_PULSES(0x44), 0};

/** @brief DS18B20 Read Scratchpad command sequence in pulse duration format */
static const uint8_t read_cmd[] = {BYTE_TO_PULSES(0xCC), BYTE_TO_PULSES(0xBE), 0};

/**
 * @brief Force timer update event and wait for update flag - used for timer initialization
 * @param T Timer register structure
 */
#define FORCE_UPDATE_EVENT(T)   \
    do {                        \
        (T).EGR = TIM_EGR(UG);  \
        __DSB();                \
        (T).SR &= ~TIM_SR(UIF); \
    } while (0)

/**
 * @}
 */

/**
 * @defgroup DS18B20_Private_Types DS18B20 Private Types
 * @{
 */

/**
 * @brief DS18B20 driver context structure using union for memory efficiency
 * @note Different stages of communication use the same memory for different purposes
 */
typedef struct {
    /**
     * @brief Union overlay for memory efficiency
     * @warning CRITICAL INVARIANT: scratchpad[n] aliases pulse[n] (same byte).
     *          decode_scratchpad() MUST read all 8 bits of pulse[byte*8..byte*8+7]
     *          BEFORE writing scratchpad[byte]. Reordering loops will corrupt bytes 0-8.
     */
    union {
        volatile uint16_t edge[DS18B20_SCRATCHPAD_BITS / 2]; /**< Edge timestamps for presence detection */
        volatile uint8_t pulse[DS18B20_SCRATCHPAD_BITS]; /**< Pulse durations for data decoding */
        uint8_t scratchpad[DS18B20_SCRATCHPAD_LEN]; /**< Sensor scratchpad data */
        uint64_t fill_union; /**< Utility field for filling the union */
    };
    ds18b20_state_t current_state; /**< Current state of the state machine */
    uint8_t address_mode; /**< 0 = Skip ROM (all devices), non-zero = Match ROM */
    uint8_t scan_mode; /**< 1 = simultaneous multi-device conversion (scan) mode */
    uint8_t scan_index; /**< Index of the device currently read in scan mode */
    uint8_t selected_rom[DS18B20_ROM_BYTES]; /**< ROM of the selected device */
    uint8_t addr_cmd[DS18B20_MATCH_SLOTS + 1]; /**< Pulse buffer for Match ROM command (+ trailing 0 for hardware bus release) */
    uint8_t resolution; /**< Conversion resolution in bits (9..12); drives the conversion wait */
} DS18B20_ctx_t;

/**
 * @}
 */

/**
 * @defgroup DS18B20_Private_Variables DS18B20 Private Variables
 * @{
 */

/** @brief Global driver context instance */
static DS18B20_ctx_t ctx;

/** @brief ROM table of the discovered devices (filled by the device search). */
static uint8_t dev_roms[DS18B20_MAX_DEVICES][DS18B20_ROM_BYTES];
/** @brief Number of devices currently stored in dev_roms. */
static uint8_t dev_count;

/* B1 guard: send_command_n() reads cmd[slots] as the trailing zero-pulse that
 * the final DMA transfer feeds into CCR1 to release the 1-Wire bus. The
 * addr_cmd buffer must therefore hold DS18B20_MATCH_SLOTS + 1 entries, not
 * DS18B20_MATCH_SLOTS, or that last slot reads one byte past the buffer. */
_Static_assert(sizeof(ctx.addr_cmd) >= DS18B20_MATCH_SLOTS + 1,
               "addr_cmd must be DS18B20_MATCH_SLOTS + 1 to hold the trailing "
               "bus-release pulse consumed by send_command_n()");

/**
 * @brief Edge capture buffer for the merged search write+read operation
 * @note Holds [write-slot edge, id_bit, cmp_bit]. Channel 2 capture runs for
 *       the whole timer pass, so the direction-write rising edge is captured
 *       into entry 0 as well; id/cmp must be decoded from entries 1 and 2.
 */
static volatile uint16_t search_edge3[3];
/**
 * @brief Read pulse durations reloaded by DMA for the merged search operation
 *        (channel 4 feeds CCR1 from this). Entry 0 is loaded at slot 1's CC4
 *        event and kicks read slots 2-3, entry 1 re-arms the slot-3 kick, and
 *        the trailing 0 is written during slot 3 so the one-pulse timer stops
 *        with the line released to idle HIGH (hardware bus release).
 */
static const uint8_t search_read_pulse[3] = {ONE_PULSE, ONE_PULSE, 0};

/**
 * @}
 */

/**
 * @defgroup DS18B20_Private_Functions DS18B20 Private Functions
 * @{
 */

/**
 * @brief Default weak implementation for busy indicator (e.g. LED toggling during measurement)
 * @param[in] action 0 = idle, non-zero = busy
 */
__WEAK void ds18b20_busy(unsigned action) {
    (void)action;
    // Default implementation - empty (no LED control)
}

/**
 * @brief Default weak implementation for measurement completion callback
 * @param[in] temp_tenths Temperature value in tenths of degrees Celsius, or error code
 */
__WEAK void ds18b20_complete(int16_t temp_tenths) {
    (void)temp_tenths;
    // Default implementation - empty (no temperature handling)
}

/**
 * @brief Calculate Dallas/Maxim CRC-8 over a byte buffer
 * @param[in] data Input buffer
 * @param[in] len Number of bytes to process
 * @return CRC-8 checksum value
 */
uint8_t ds18b20_crc8(const uint8_t* data, uint8_t len) {
    uint8_t crc = 0;
    // Process each byte in the buffer
    for (uint8_t i = 0; i < len; i++) {
        uint8_t inByte = data[i];
        // Process each bit in the byte using Dallas/Maxim CRC8 algorithm
        for (uint8_t b = 0; b < DS18B20_BITS_PER_BYTE; b++) {
            uint8_t mix = (crc ^ inByte) & 0x01;
            crc >>= 1;
            if (mix) crc ^= DS18B20_CRC8_POLY;
            inByte >>= 1;
        }
    }
    return crc;
}

/**
 * @brief Calculate CRC8 checksum for DS18B20 scratchpad data validation
 * @return CRC8 checksum value
 */
__STATIC_FORCEINLINE uint8_t check_scratchpad_crc(void) {
    return ds18b20_crc8(ctx.scratchpad, DS18B20_CRC8_BYTES);
}

/**
 * @brief Decode pulse durations into scratchpad bytes using bit timing analysis
 * @note Branchless implementation: accumulates bits into native-width variable,
 *       then writes once per byte. Relies on union aliasing invariant — see DS18B20_ctx_t.
 */
__STATIC_FORCEINLINE void decode_scratchpad(void) {
    for (unsigned byte = 0; byte < DS18B20_SCRATCHPAD_LEN; ++byte) {
        const unsigned base = byte * DS18B20_BITS_PER_BYTE;
        unsigned value = 0;
        for (unsigned bit = 0; bit < DS18B20_BITS_PER_BYTE; ++bit) {
            value |= (unsigned)(ctx.pulse[base + bit] <= SHORT_PULSE_MAX) << bit;
        }
        ctx.scratchpad[byte] = (uint8_t)value;
    }
}

/**
 * @brief Convert raw temperature data from scratchpad to tenths of degrees Celsius
 * @return Temperature value in tenths of degrees Celsius
 */
__STATIC_FORCEINLINE int16_t decode_temperature(void) {
    // Combine LSB and MSB of temperature register (bytes 0 and 1)
    int16_t raw = (int16_t)((ctx.scratchpad[1] << 8) | ctx.scratchpad[0]);
    // Convert to tenths of degrees Celsius (raw value in 1/16th degrees):
    // multiply by 10 and divide by 16 with round-half-away-from-zero so the
    // sign is preserved for small negative values (raw = -1 would otherwise
    // truncate to 0 and report +0.0 °C for a temperature below freezing).
    return (int16_t)(((int32_t)raw * 10 + ((raw < 0) ? -8 : 8)) / 16);
}

/**
 * @brief Verify presence of DS18B20 sensor by checking reset pulse timing
 * @return 1 if device present, 0 if no device detected
 */
__STATIC_FORCEINLINE unsigned check_presence(void) {
    uint16_t reset = ctx.edge[0];
    uint16_t presence = ctx.edge[1];
    // Validate that reset pulse duration is within specification
    // and presence pulse timing indicates a responding device
    return (reset >= RESET_PULSE_MIN) && (reset <= RESET_PULSE_MAX) &&
           (presence >= PRESENCE_PULSE_MIN) && (presence <= PRESENCE_PULSE_MAX);
}

/**
 * @brief Start timer with specified period and repetition count for precise timing
 * @param[in] arr Auto-reload register value
 * @param[in] rcr Repetition counter value
 */
__STATIC_FORCEINLINE void start_timer(uint16_t arr, uint8_t rcr) {
    T1.ARR = arr;
    T1.RCR = rcr;
    // Force update event to load new values
    FORCE_UPDATE_EVENT(T1);
    // Start timer in One Pulse Mode (OPM) - runs once then stops
    T1.CR1 = TIM_CR1(OPM, CEN);
}

/**
 * @brief Map a conversion resolution to its exact DS18B20 conversion time
 * @param[in] res Resolution in bits (9..12)
 * @param[out] arr Auto-reload value (one timer period in µs)
 * @param[out] rcr Repetition counter (number of periods - 1)
 * @note DS18B20 datasheet conversion times: 9-bit 93.75ms, 10-bit 187.5ms,
 *       11-bit 375ms, 12-bit 750ms. The (ARR, RCR) pairs below reproduce
 *       exactly those minimum waits at 1µs/tick with the invariant
 *       (RCR + 1) × ARR = wait in µs.
 */
__STATIC_FORCEINLINE void resolution_to_wait(uint8_t res, uint16_t* arr, uint8_t* rcr) {
    switch (res) {
    case 9:
        *arr = 9375;
        *rcr = 9;
        break; /* 10 × 9.375ms = 93.75ms */
    case 10:
        *arr = 18750;
        *rcr = 9;
        break; /* 10 × 18.75ms = 187.5ms */
    case 11:
        *arr = 18750;
        *rcr = 19;
        break; /* 20 × 18.75ms = 375ms */
    case 12:
    default:
        *arr = 62500;
        *rcr = 11;
        break; /* 12 × 62.5ms = 750ms */
    }
}

/**
 * @brief Wait for temperature conversion to complete
 * @note Non-blocking - starts a timer that generates an update event when the
 *       conversion of the currently configured resolution (ctx.resolution)
 *       is guaranteed finished: 93.75ms (9 bit) .. 750ms (12 bit).
 */
__STATIC_FORCEINLINE void wait_conversion(void) {
    uint16_t arr;
    uint8_t rcr;
    resolution_to_wait(ctx.resolution, &arr, &rcr);
    start_timer(arr, rcr);
}

/**
 * @brief Start inter-measurement pause period (5s)
 * @note Non-blocking - starts timer for inter-measurement delay
 */
__STATIC_FORCEINLINE void start_cycle_pause(void) { start_timer(PAUSE_5S); }

/**
 * @brief Configure timer and DMA for capture operation
 * @param[out] dst Destination buffer for captured data
 * @param[in] count Number of transfers
 * @param[in] width DMA transfer width: 8 for 8-bit, 16 for 16-bit
 */
__STATIC_FORCEINLINE void arm_capture(volatile void* dst, uint16_t count, uint16_t width) {
    T1.CCMR1 = TIM_CCMR1(OC1M_0, OC1M_1, OC1M_2, OC1PE, CC2S_1, IC2F_0, IC2F_1, IC2F_2);
    T1.CCER = TIM_CCER(CC1E, CC2E);
    T1.DIER = TIM_DIER(CC2DE);
    FORCE_UPDATE_EVENT(T1);
    T1.CCR1 = 0;
    D13.CCR = 0;
    D13.CPAR = (uint32_t)&T1.CCR2;
    D13.CMAR = (uint32_t)dst;
    D13.CNDTR = count;
    D13.CCR = DS18B20_DMA_CCR_CAPTURE | ((width == 16) ? DMA_CCR_MSIZE_0 : 0);
    T1.CR1 = TIM_CR1(OPM, CEN);
}

/**
 * @brief Initialize 1-Wire bus reset sequence using timer and DMA
 */
__STATIC_FORCEINLINE void reset_bus(void) {
    T1.RCR = 0;
    T1.ARR = RESET_TIMEOUT;
    T1.CCR1 = RESET_PULSE_DURATION;
    arm_capture((volatile void*)ctx.edge, CAPTURE_BUF_SIZE, 16);
}

/**
 * @brief Transmit a command sequence of arbitrary length to DS18B20 using DMA
 * @param[in] cmd Pointer to command sequence in pulse duration format
 * @param[in] slots Number of bit slots (bits) to transmit
 * @note Non-blocking - configures hardware to transmit command automatically.
 * @note The buffer must hold `slots + 1` entries and the entry at index
 *       `slots` must be 0: the final CC4-triggered DMA transfer feeds that
 *       trailing 0 into CCR1 during the last slot, so the one-pulse timer
 *       stops with the line already released to idle HIGH (hardware bus
 *       release — no software CCR1 write needed afterwards).
 */
__STATIC_FORCEINLINE void send_command_n(const uint8_t* cmd, uint16_t slots) {
    T1.RCR = slots - 1;
    T1.ARR = ONE_PULSE + ZERO_PULSE + GUARD_BAND;
    T1.CCR1 = cmd[0];
    T1.CCR4 = ONE_PULSE + ZERO_PULSE;
    T1.CCMR1 = TIM_CCMR1(OC1M_0, OC1M_1, OC1M_2);
    T1.CCER = TIM_CCER(CC1E);
    T1.DIER = TIM_DIER(CC4DE);
    FORCE_UPDATE_EVENT(T1);
    D14.CCR = 0;
    D14.CPAR = (uint32_t)&T1.CCR1;
    D14.CMAR = (uint32_t)&cmd[1];
    D14.CNDTR = slots; // Feed slots 2..N, then the trailing 0 (bus release)
    D14.CCR = DMA_CCR(DIR, MINC, PSIZE_0, EN);
    T1.CR1 = TIM_CR1(OPM, CEN);
}

/**
 * @brief Transmit a two-byte command sequence (Skip ROM + command) using DMA
 * @param[in] cmd Pointer to command sequence in pulse duration format
 * @note Non-blocking - configures hardware to transmit command automatically
 */
__STATIC_FORCEINLINE void send_command(const uint8_t* cmd) {
    send_command_n(cmd, DS18B20_DMA_TRANSFERS);
}

/**
 * @brief Encode a byte into pulse durations (ONE_PULSE for '1', ZERO_PULSE for '0')
 * @param[out] out Output buffer (8 entries)
 * @param[in] byte Byte value to encode
 */
__STATIC_FORCEINLINE void encode_byte_pulses(uint8_t* out, uint8_t byte) {
    for (uint8_t i = 0; i < DS18B20_BITS_PER_BYTE; i++) {
        out[i] = (byte & (1u << i)) ? (uint8_t)ONE_PULSE : (uint8_t)ZERO_PULSE;
    }
}

/**
 * @brief Build the invariant Match ROM prefix (0x55 + selected ROM)
 * @note Fills the first DS18B20_PREFIX_SLOTS entries of ctx.addr_cmd.
 *       The prefix depends only on the selected device, so it is built
 *       once in ds18b20_select() and reused for every command.
 */
__STATIC_FORCEINLINE void build_addr_prefix(void) {
    uint8_t* p = ctx.addr_cmd;
    encode_byte_pulses(p, DS18B20_MATCH_ROM);
    p += DS18B20_BITS_PER_BYTE;
    for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
        encode_byte_pulses(p, ctx.selected_rom[i]);
        p += DS18B20_BITS_PER_BYTE;
    }
    /* B1: guarantee the trailing zero-pulse that send_command_n() reads as its
     * final DMA transfer into CCR1 is present, even though build_addr_cmd()
     * only ever writes slots 0 .. DS18B20_MATCH_SLOTS - 1. Without this, the
     * bus-release pulse would depend on whatever happened to sit at
     * addr_cmd[DS18B20_MATCH_SLOTS] (typically 0 from .bss, but not guaranteed). */
    ctx.addr_cmd[DS18B20_MATCH_SLOTS] = 0;
}

/**
 * @brief Append one command byte to the pre-built Match ROM prefix
 * @param[in] cmd_byte Command byte to send after the ROM address
 * @note Requires build_addr_prefix() to have been called for the current
 *       selected device. Only the last byte (8 slots) is re-encoded per call.
 */
__STATIC_FORCEINLINE void build_addr_cmd(uint8_t cmd_byte) {
    encode_byte_pulses(&ctx.addr_cmd[DS18B20_PREFIX_SLOTS], cmd_byte);
}

/**
 * @brief Read scratchpad data from DS18B20 using timer capture and DMA
 * @note Non-blocking - configures hardware to capture data automatically
 */
__STATIC_FORCEINLINE void read_data(void) {
    T1.RCR = DS18B20_SCRATCHPAD_BITS - 1;
    T1.ARR = ONE_PULSE + ZERO_PULSE + GUARD_BAND;
    T1.CCR1 = ONE_PULSE;
    arm_capture((volatile void*)ctx.pulse, DS18B20_SCRATCHPAD_BITS, 8);
}

/**
 * @}
 */

/**
 * @defgroup DS18B20_Bus DS18B20 Internal 1-Wire Bus Primitives
 * @brief Private non-blocking 1-Wire bus primitives used by the measurement
 *        state machine and the built-in device search. Each function only
 *        schedules a hardware-timed operation on TIM1/DMA and returns
 *        immediately. They are internal to the driver and not exposed to the
 *        application.
 * @{
 */

/**
 * @brief Schedule a 1-Wire bus reset (presence pulse captured via DMA)
 */
static void ds18b20_bus_reset(void) { reset_bus(); }

/**
 * @brief Non-blocking completion check for the scheduled bus operation
 * @return 1 if finished (update flag cleared), 0 while still running
 */
static uint8_t ds18b20_bus_done(void) {
    if (T1.SR & TIM_SR(UIF)) {
        // No software bus release needed: every operation now returns the line
        // to idle HIGH in hardware. DMA-fed writes (send_command_n,
        // write_then_read) append a trailing 0 to the CCR1 feed, and the
        // direct-write/capture operations (reset, read, single slot) use an
        // OC1PE preload of 0 — both applied exactly when the one-pulse timer
        // stops. The bus therefore idles HIGH between slots regardless of how
        // long software takes to poll, and the next write pulse produces a
        // clean falling edge the DS18B20s re-sync to.
        T1.SR = 0;
        return 1u;
    }
    return 0u;
}

/**
 * @brief Check presence of the last scheduled bus reset
 * @return 1 if at least one device answered, 0 otherwise
 */
static uint8_t ds18b20_bus_present(void) { return (uint8_t)check_presence(); }

/**
 * @brief Encode a byte into pulse durations (ONE_PULSE for '1', ZERO_PULSE for '0')
 * @param[out] out Output buffer (8 entries)
 * @param[in] byte Byte value to encode
 */
static void ds18b20_bus_encode_byte(uint8_t* out, uint8_t byte) {
    encode_byte_pulses(out, byte);
}

/**
 * @brief Schedule a write of `slots` bit slots
 * @note Non-blocking: configures the hardware and returns. The pulses buffer
 *       must stay valid until ds18b20_bus_done() reports completion, since
 *       the DMA feeds CCR1 from it (except for a single slot, written directly).
 * @note For `slots > 1` the buffer must also hold a trailing 0 at index
 *       `slots` (see send_command_n) so the bus is released in hardware.
 */
static void ds18b20_bus_write_slots(const uint8_t* pulses, uint16_t slots) {
    if (slots == 1) {
        // Single slot: no DMA needed, avoids a zero-length DMA transaction
        T1.RCR = 0; // Single slot, no repetition
        T1.ARR = ONE_PULSE + ZERO_PULSE + GUARD_BAND; // Total bit slot time
        T1.CCR1 = pulses[0]; // Pulse duration encodes the bit
        // Configure channel 1 for output compare (drive bus low during the pulse).
        // OC1PE plus a preload zero release the bus at the terminal update event,
        // exactly when the one-pulse timer stops (hardware bus release).
        T1.CCMR1 = TIM_CCMR1(OC1M_0, OC1M_1, OC1M_2, OC1PE);
        T1.CCER = TIM_CCER(CC1E); // Enable output compare
        T1.DIER = 0; // No DMA for a single bit slot
        FORCE_UPDATE_EVENT(T1);
        T1.CCR1 = 0; // Preload 0 -> line idles HIGH when the timer stops
        T1.CR1 = TIM_CR1(OPM, CEN); // Start timer in one-pulse mode
        return;
    }
    send_command_n(pulses, slots);
}

/**
 * @brief Schedule a single-slot write of one raw bit (encodes 0/1 to a pulse)
 * @param[in] bit Bit value to write (0 or 1)
 */
static void ds18b20_bus_write_bit(uint8_t bit) {
    uint8_t pulse = bit ? (uint8_t)ONE_PULSE : (uint8_t)ZERO_PULSE;
    ds18b20_bus_write_slots(&pulse, 1);
}

