a5021/stm32-async-1wire/src/ds18b20.c
/**
 * @brief Schedule a two-slot read for the Search ROM id/cmp bit pair
 * @note Non-blocking: captures both slot timings into ctx.edge via DMA.
 *       Read the decoded bits with ds18b20_bus_pair_id()/cmp() once
 *       ds18b20_bus_done() reports completion.
 */
static void ds18b20_bus_read_pair(void) {
    // Configure timer for a two-slot read (id_bit, cmp_bit)
    T1.RCR = 1; // Two read slots, then a single update event
    T1.ARR = ONE_PULSE + ZERO_PULSE + GUARD_BAND; // Total bit slot time
    T1.CCR1 = ONE_PULSE; // Read pulse duration (ONE_PULSE µs)
    // Configure channel 1 for output compare (generate read pulse)
    // Configure channel 2 for input capture (measure return pulse durations)
    T1.CCMR1 = TIM_CCMR1(OC1M_0, OC1M_1, OC1M_2, OC1PE, CC2S_1, IC2F_0, IC2F_1, IC2F_2);
    T1.CCER = TIM_CCER(CC1E, CC2E); // Enable both channels
    T1.DIER = TIM_DIER(CC2DE); // Enable DMA request on capture
    FORCE_UPDATE_EVENT(T1);
    T1.CCR1 = 0; // Clear output compare value
    // Configure DMA to capture both slot timings into the edge buffer
    D13.CCR = 0; // Clear DMA configuration
    D13.CPAR = (uint32_t)&T1.CCR2; // DMA source: capture register
    D13.CMAR = (uint32_t)ctx.edge; // DMA destination: edge timestamp buffer
    D13.CNDTR = 2; // Number of transfers (id_bit, cmp_bit)
    D13.CCR = DMA_CCR(MINC, PSIZE_0, MSIZE_0, EN); // Enable DMA with memory increment
    T1.CR1 = TIM_CR1(OPM, CEN); // Start timer in one-pulse mode
}

/**
 * @brief Decode the id-bit of the last ds18b20_bus_read_pair()
 * @return Bit value (0 or 1)
 */
static uint8_t ds18b20_bus_pair_id(void) {
    return (ctx.edge[0] <= SHORT_PULSE_MAX) ? 1u : 0u;
}

/**
 * @brief Decode the cmp-bit of the last ds18b20_bus_read_pair()
 * @return Bit value (0 or 1)
 */
static uint8_t ds18b20_bus_pair_cmp(void) {
    return (ctx.edge[1] <= SHORT_PULSE_MAX) ? 1u : 0u;
}

/**
 * @brief Schedule a merged single-slot write followed by a two-slot read pair
 * @param[in] bit Direction bit to write in slot 1 (0 or 1)
 * @note Non-blocking: one timer pass runs three slots — a write of `bit`
 *       (slot 1), then a read of the next id/cmp pair (slots 2-3). This
 *       halves the number of timer passes per search bit compared to a plain
 *       write followed by a separate read pair.
 * @note OC1 is configured in PWM mode WITHOUT preload (OC1PE clear), so the
 *       CCR4-triggered DMA reload of the read pulse takes effect immediately
 *       at the end of slot 1. With OC1PE set the reload would be buffered in
 *       the preload register and never applied before the read slots.
 * @note Channel 2 input capture is armed for the whole pass, so the write-slot
 *       rising edge lands in search_edge3[0]. Decode the id/cmp bits from
 *       search_edge3[1] and search_edge3[2] once ds18b20_bus_done() returns 1.
 */
static void ds18b20_bus_write_then_read(uint8_t bit) {
    const uint8_t write_pulse = bit ? (uint8_t)ONE_PULSE : (uint8_t)ZERO_PULSE;
    T1.RCR = 2; // Three slots, then a single update event
    T1.ARR = ONE_PULSE + ZERO_PULSE + GUARD_BAND; // Total bit slot time
    // Arm the direction pulse first. The bus was released idle-high by
    // ds18b20_bus_done(), so this write produces the single clean falling edge
    // the devices re-sync their slot timer to; the pulse then holds the bus low
    // through the whole (fast) setup. Holding it from the top instead of arming
    // it right before CEN means the CC2 capture is armed while the bus is low,
    // so the open-drain RC rise can never be mistaken for a slot edge.
    T1.CCR1 = write_pulse; // Slot 1 write pulse encodes the direction bit
    T1.CCR4 = ONE_PULSE + ZERO_PULSE; // End-of-slot reload trigger
    // OC1 in PWM mode (no preload so the reload is immediate), CC2 capture armed
    T1.CCMR1 = TIM_CCMR1(OC1M_0, OC1M_1, OC1M_2, CC2S_1, IC2F_0, IC2F_1, IC2F_2);
    T1.CCER = TIM_CCER(CC1E, CC2E); // Enable both channels
    // Disconnect DMA requests while re-arming the channels, then re-connect
    // them only after the timer flags are clean and just before starting.
    // (The end-of-slot CC4 compare event of the previous merged operation can
    // leave a pending request that fires the reload DMA immediately on re-arm,
    // overwriting the freshly written direction pulse in CCR1.)
    T1.DIER = 0;
    FORCE_UPDATE_EVENT(T1);
    // DMA Ch3: capture all three slot edges into the merged-edge buffer
    D13.CCR = 0;
    D13.CPAR = (uint32_t)&T1.CCR2;
    D13.CMAR = (uint32_t)search_edge3;
    D13.CNDTR = 3;
    D13.CCR = DMA_CCR(MINC, PSIZE_0, MSIZE_0, EN);
    // DMA Ch4: reload CCR1 with the read pulse for slots 2-3, then write the
    // trailing 0 during slot 3 so the one-pulse timer stops with the line
    // released to idle HIGH (hardware bus release).
    D14.CCR = 0;
    D14.CPAR = (uint32_t)&T1.CCR1;
    D14.CMAR = (uint32_t)search_read_pulse;
    D14.CNDTR = 3;
    D14.CCR = DMA_CCR(DIR, MINC, PSIZE_0, EN);
    T1.SR = 0; // Clear any pending capture/compare flags before enabling DMA requests
    T1.DIER = TIM_DIER(CC2DE, CC4DE); // Capture + CCR1 reload via DMA
    T1.CCR1 = write_pulse; // Re-arm the direction pulse (safe against a stale CC4 DMA reload)
    T1.CR1 = TIM_CR1(OPM, CEN); // Start timer in one-pulse mode
}

/**
 * @}
 */

/**
 * @defgroup DS18B20_Search_Internal DS18B20 Internal Non-Blocking Device Search
 * @brief Maxim Search ROM (0xF0) state machine. The algorithm is inherently
 *        sequential: the direction bit written at position i determines which
 *        devices keep participating at position i+1, so the whole transaction
 *        cannot be batched into a single DMA pass like the fixed measurement
 *        sequence. Instead, the linear blocking loop is decomposed into a
 *        compact state machine with loop counters kept in the context
 *        (id_bit_number, last_discrepancy, ...). Each state performs exactly
 *        one hardware-timed operation via the internal bus primitives, so a
 *        poll call never blocks.
 * @{
 */

/** @brief Search state machine phases */
typedef enum {
    DS18B20_SEARCH_RESET, /**< reset scheduled; check presence, send 0xF0 */
    DS18B20_SEARCH_CMD, /**< 0xF0 sent; prepare first bit iteration */
    DS18B20_SEARCH_READ_PAIR, /**< first id/cmp pair read; compute and write direction */
    DS18B20_SEARCH_WRITE_READ, /**< merged direction write + next pair read completed */
    DS18B20_SEARCH_WRITE_DIR, /**< final direction written; advance bit counters */
    DS18B20_SEARCH_DONE, /**< search finished; restore the driver state */
#ifdef DS18B20_TEST_HARNESS
    DS18B20_SEARCH_GAP /**< [TEST] timed idle-HIGH gap before the next slot */
#endif
} search_phase_t;

/**
 * @brief Non-blocking search context
 * @note Holds the loop counters of the search algorithm; the persistent pulse
 *       buffer (pulses) must stay valid across poll calls because the DMA
 *       feeds CCR1 from it asynchronously while the 0xF0 command is sent.
 */
typedef struct {
    search_phase_t phase; /**< Current phase of the search state machine */
    uint8_t rom[DS18B20_ROM_BYTES]; /**< ROM being assembled (bit by bit) */
    uint8_t pulses[DS18B20_BITS_PER_BYTE + 1]; /**< Pulse buffer for the 0xF0 command (+ trailing 0 for hardware bus release) */
    uint8_t id_bit_number; /**< Current bit position (1..64) */
    uint16_t last_discrepancy; /**< Last discrepancy point (Maxim algorithm) */
    uint16_t last_zero; /**< Last position where the '0' branch was taken */
    uint8_t found; /**< Number of DS18B20 devices found */
    uint8_t max; /**< Maximum number of devices to report */
    uint8_t finished; /**< 1 once the search has completed */
    ds18b20_search_sink_t sink; /**< Per-device callback */
} search_ctx_t;

