a5021/stm32-async-1wire/src/ds18b20.c
/** @brief Global search context instance */
static search_ctx_t search_ctx;

#ifdef DS18B20_TEST_HARNESS
/** @brief [TEST] Idle-HIGH gap (µs) inserted after every completed search
 *         operation before scheduling the next one (0 = no gap). */
static uint16_t test_gap_us;
/** @brief [TEST] Search phase to resume after the gap wait completes */
static uint8_t test_gap_pending_phase;

/**
 * @brief [TEST] Set the idle-HIGH gap injected between search slots
 * @param[in] us Gap duration in microseconds (0 disables the injection)
 * @note Temporary test hook for the RTOS-latency experiment only.
 */
void ds18b20_test_set_gap_us(uint16_t us) { test_gap_us = us; }
#endif

/**
 * @brief Start a non-blocking device search
 * @param[in] sink Callback invoked per found DS18B20 device (may be NULL)
 * @param[in] max_devices Maximum number of devices to report (0 aborts)
 */
void ds18b20_search_start(ds18b20_search_sink_t sink, uint8_t max_devices) {
    // Ownership guard: the search and the measurement state machine share
    // TIM1/DMA, so a new search may only be started when the timer is free.
    if (!search_ctx.finished) {
        return; // a search is already running
    }
    if (ctx.current_state != DS18B20_ST_IDLE) {
        return; // a measurement cycle is in progress
    }
    for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
        search_ctx.rom[i] = 0;
    }
    // Trailing zero consumed by the CCR1-feed DMA's final transfer: this is the
    // hardware bus release after the 0xF0 command (see send_command_n).
    search_ctx.pulses[DS18B20_BITS_PER_BYTE] = 0;
    search_ctx.sink = sink;
    search_ctx.max = max_devices;
    search_ctx.found = 0;
    search_ctx.finished = 0;
    search_ctx.last_discrepancy = 0;
    dev_count = 0;
    if (max_devices == 0) {
        search_ctx.phase = DS18B20_SEARCH_DONE;
        return;
    }
    search_ctx.phase = DS18B20_SEARCH_RESET;
    ds18b20_bus_reset(); // Schedule the first hardware operation
}

/**
 * @brief Process one decoded id/cmp pair: pick a direction, update the ROM,
 *        and schedule the next hardware operation
 * @param[in] id_bit Id bit of the current position
 * @param[in] cmp_bit Complement bit of the current position
 * @note For all but the last bit the direction write is merged with the read
 *       of the next pair (DS18B20_SEARCH_WRITE_READ); the 64th bit is written
 *       alone so the device can be finalized.
 */
static void ds18b20_search_advance_bit(uint8_t id_bit, uint8_t cmp_bit) {
    const uint8_t byte_idx = (search_ctx.id_bit_number - 1) / DS18B20_BITS_PER_BYTE;
    const uint8_t mask = (uint8_t)(1u << ((search_ctx.id_bit_number - 1) % DS18B20_BITS_PER_BYTE));
    uint8_t direction;

    if (id_bit && cmp_bit) {
        // No device follows this path - search tree exhausted
        search_ctx.phase = DS18B20_SEARCH_DONE;
        return;
    }
    if (id_bit != cmp_bit) {
        // Single device on this path - its bit fixes the direction
        direction = id_bit;
    } else if (search_ctx.id_bit_number < search_ctx.last_discrepancy) {
        // Follow the previously taken path
        direction = (search_ctx.rom[byte_idx] & mask) ? 1u : 0u;
        if (direction == 0) {
            // Remember the last 0-branch taken at a discrepancy
            search_ctx.last_zero = search_ctx.id_bit_number;
        }
    } else {
        // At the discrepancy point take the '1' branch first
        direction = (search_ctx.id_bit_number == search_ctx.last_discrepancy) ? 1u : 0u;
        if (direction == 0) {
            // Remember the last 0-branch taken at a discrepancy
            search_ctx.last_zero = search_ctx.id_bit_number;
        }
    }
    if (direction) {
        search_ctx.rom[byte_idx] |= mask;
    } else {
        search_ctx.rom[byte_idx] &= (uint8_t)~mask;
    }
    if (search_ctx.id_bit_number < DS18B20_ROM_BITS) {
        // Merge the direction write with the read of the next id/cmp pair.
        ds18b20_bus_write_then_read(direction);
        search_ctx.phase = DS18B20_SEARCH_WRITE_READ;
    } else {
        ds18b20_bus_write_bit(direction);
        search_ctx.phase = DS18B20_SEARCH_WRITE_DIR;
    }
}

/**
 * @brief Advance the non-blocking device search
 * @return 1 when the search is finished, 0 while still running
 */
uint8_t ds18b20_search_poll(void) {
    if (search_ctx.finished) {
        return 1;
    }

    if (search_ctx.phase == DS18B20_SEARCH_DONE) {
        // No hardware operation is pending at the end of the search: hand the
        // timer back to the measurement state machine exactly once.
        T1.EGR = TIM_EGR(UG);
        __DSB();
        search_ctx.finished = 1;
        return 1;
    }

    // Wait for the currently scheduled hardware operation to complete.
    // This is a non-blocking poll, not a busy-wait.
    if (!ds18b20_bus_done()) {
        return 0;
    }

#ifdef DS18B20_TEST_HARNESS
    // [TEST] Inject a hardware-timed idle-HIGH gap between search slots to
    // measure the DS18B20's tolerance to a delayed next slot (RTOS scenario).
    if (test_gap_us != 0u && search_ctx.phase != DS18B20_SEARCH_GAP) {
        test_gap_pending_phase = (uint8_t)search_ctx.phase;
        search_ctx.phase = DS18B20_SEARCH_GAP;
        start_timer(test_gap_us, 0);
        return 0;
    }
    if (search_ctx.phase == DS18B20_SEARCH_GAP) {
        search_ctx.phase = (search_phase_t)test_gap_pending_phase;
    }
#endif

    switch (search_ctx.phase) {
    case DS18B20_SEARCH_RESET:
        // Reset completed: a presence pulse means at least one device is on
        // the bus, so start a new search pass with the Search ROM command.
        if (!ds18b20_bus_present()) {
            search_ctx.phase = DS18B20_SEARCH_DONE;
            break;
        }
        ds18b20_bus_encode_byte(search_ctx.pulses, DS18B20_SEARCH_ROM);
        ds18b20_bus_write_slots(search_ctx.pulses, DS18B20_BITS_PER_BYTE);
        search_ctx.phase = DS18B20_SEARCH_CMD;
        break;

    case DS18B20_SEARCH_CMD:
        // 0xF0 sent: prepare the first bit iteration and read the id/cmp pair.
        search_ctx.id_bit_number = 1;
        search_ctx.last_zero = 0;
        ds18b20_bus_read_pair();
        search_ctx.phase = DS18B20_SEARCH_READ_PAIR;
        break;

    case DS18B20_SEARCH_READ_PAIR:
        // First id/cmp pair decoded from the plain two-slot read.
#ifdef DS18B20_SEARCH_DIAG
        uart_write_str("[P#1 ");
        uart_write_int(ds18b20_bus_pair_id());
        uart_write_str("/");
        uart_write_int(ds18b20_bus_pair_cmp());
        uart_write_str("] ");
#endif
        ds18b20_search_advance_bit(ds18b20_bus_pair_id(), ds18b20_bus_pair_cmp());
        break;

    case DS18B20_SEARCH_WRITE_READ:
        // The merged operation wrote the direction for the previous bit and
        // captured the id/cmp pair of the current bit into search_edge3.
        search_ctx.id_bit_number++;
#ifdef DS18B20_SEARCH_DIAG
        uart_write_str("[W+R#");
        uart_write_int(search_ctx.id_bit_number);
        uart_write_str(" ");
        for (uint8_t di = 0; di < 3; di++) {
            uart_write_int(search_edge3[di]);
            uart_write_str(":");
        }
        uart_write_str("->");
        uart_write_int((search_edge3[1] <= SHORT_PULSE_MAX) ? 1u : 0u);
        uart_write_str("/");
        uart_write_int((search_edge3[2] <= SHORT_PULSE_MAX) ? 1u : 0u);
        uart_write_str("] ");
#endif
        ds18b20_search_advance_bit(
            (search_edge3[1] <= SHORT_PULSE_MAX) ? 1u : 0u,
            (search_edge3[2] <= SHORT_PULSE_MAX) ? 1u : 0u);
        break;

    case DS18B20_SEARCH_WRITE_DIR:
        // The final (64th) direction bit was written: the ROM is assembled.
        search_ctx.id_bit_number++;
        search_ctx.last_discrepancy = search_ctx.last_zero;
        if (ds18b20_crc8(search_ctx.rom, DS18B20_ROM_BYTES) != 0) {
            search_ctx.phase = DS18B20_SEARCH_DONE;
            break;
        }
        if (search_ctx.rom[0] == DS18B20_FAMILY_CODE) {
            search_ctx.found++;
            // Store the ROM in the driver's device table for scan mode. The
            // table is capped at DS18B20_MAX_DEVICES; extra devices are still
            // reported to the sink but not addressable in scan mode.
            if (dev_count < DS18B20_MAX_DEVICES) {
                for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
                    dev_roms[dev_count][i] = search_ctx.rom[i];
                }
                dev_count++;
            }
            if (search_ctx.sink && search_ctx.sink(search_ctx.rom)) {
                search_ctx.phase = DS18B20_SEARCH_DONE;
                break;
            }
            if (search_ctx.found >= search_ctx.max) {
                search_ctx.phase = DS18B20_SEARCH_DONE;
                break;
            }
        }
        if (search_ctx.last_discrepancy == 0) {
            search_ctx.phase = DS18B20_SEARCH_DONE;
            break;
        }
        // Another device may exist - run another search pass.
        ds18b20_bus_reset();
        search_ctx.phase = DS18B20_SEARCH_RESET;
        break;

    case DS18B20_SEARCH_DONE:
#ifdef DS18B20_TEST_HARNESS
    case DS18B20_SEARCH_GAP:
#endif
        // DONE and GAP are handled before the switch (see above); keep as a
        // no-op so -Wswitch-enum stays satisfied.
        break;

    default:
        break;
    }

