a5021/stm32-async-1wire/src/ds18b20.c
    // Wait for the currently scheduled hardware operation to complete.
    // This is a non-blocking poll, not a busy-wait.
    if (!ds18b20_bus_done()) {
        return 0;
    }

    switch (res_ctx.phase) {
    case DS18B20_RES_RESET:
        // Reset completed: a presence pulse means at least one device is on
        // the bus, so send the config write for the requested resolution.
        if (!ds18b20_bus_present()) {
            res_ctx.phase = DS18B20_RES_DONE;
            break;
        }
        ds18b20_bus_write_slots(res_ctx.pulses,
                                ctx.address_mode ? DS18B20_RES_SLOTS_MAX
                                                 : DS18B20_RES_SLOTS_MIN);
        res_ctx.phase = DS18B20_RES_WRITE;
        break;

    case DS18B20_RES_WRITE:
        // Config write completed: the sensor now uses the new resolution.
        res_ctx.applied = 1;
        res_ctx.phase = DS18B20_RES_DONE;
        break;

    case DS18B20_RES_DONE:
    default:
        break;
    }

    return 0;
}

/**
 * @brief Current conversion resolution in bits
 * @return Resolution in bits (9..12); the default is 12
 * @note Auto-derived from the last valid scratchpad read (byte 4, R1/R0),
 *       so it also tracks a resolution changed externally.
 */
uint8_t ds18b20_get_resolution(void) { return ctx.resolution; }

/**
 * @brief Finish the current scan-mode device read
 * @note Called after every per-device report in scan mode. Advances to the
 *       next device (CONTINUE, skipping a fresh conversion) or, after the last
 *       device, returns to IDLE and starts the inter-measurement pause so the
 *       next round begins with a new broadcast Convert T. In single-device
 *       mode it only starts the inter-measurement pause.
 */
static void scan_finish_or_next(void) {
    if (!ctx.scan_mode) {
        start_cycle_pause();
        return;
    }
    ctx.scan_index++;
    if (ctx.scan_index < dev_count) {
        ctx.current_state = DS18B20_ST_CONTINUE;
    } else {
        ctx.current_state = DS18B20_ST_IDLE;
        start_cycle_pause();
    }
}

/**
 * @brief Begin simultaneous conversion of every discovered device
 * @see ds18b20_scan_start() in ds18b20.h
 */
void ds18b20_scan_start(void) {
    if (ctx.current_state != DS18B20_ST_IDLE) {
        return; // a measurement cycle is in progress
    }
    if (!search_ctx.finished || !res_ctx.finished) {
        return; // the search or a resolution change owns the timer
    }
    if (dev_count == 0) {
        return; // nothing discovered: there is no device to convert
    }
    ctx.scan_mode = 1;
    ctx.scan_index = 0;
}

/**
 * @brief Number of DS18B20 devices stored by the driver
 * @see ds18b20_device_count() in ds18b20.h
 */
uint8_t ds18b20_device_count(void) { return dev_count; }

/**
 * @brief ROM address of a discovered device
 * @see ds18b20_device_rom() in ds18b20.h
 */
const uint8_t* ds18b20_device_rom(uint8_t index) {
    if (index >= dev_count) {
        return 0;
    }
    return dev_roms[index];
}

/**
 * @brief Index of the device whose result ds18b20_complete() just reported
 * @see ds18b20_scan_index() in ds18b20.h
 */
uint8_t ds18b20_scan_index(void) { return ctx.scan_index; }

/**
 * @}
 */

/**
 * @defgroup DS18B20_Public_Functions DS18B20 Public Functions
 * @{
 */

/**
 * @brief Initialize DS18B20 driver - configure clocks and peripherals
 */
void ds18b20_init(void) {
    // No search running after init: lets the measurement state machine own the
    // timer until the application starts a device search.
    search_ctx.finished = 1;
    // No resolution change running after init; the DS18B20 powers up at 12 bit
    // (750ms conversion), so wait for exactly that until a scratchpad read or
    // set_resolution tells us otherwise.
    res_ctx.finished = 1;
    ctx.resolution = DS18B20_RES_DEFAULT;
    ctx.scan_mode = 0;
    ctx.scan_index = 0;
    // Enable clocks for required peripherals: GPIOA, TIM1, DMA1
    RC.APB2ENR |= RCC_APB2ENR(IOPAEN, TIM1EN);
    RC.AHBENR |= RCC_AHBENR(DMA1EN);
    // Configure timer prescaler for 1µs resolution (SYSCLK / 1000000 - 1)
    T1.PSC = TIM_PRESCALER;
    T1.EGR = TIM_EGR(UG);
    __DSB();
    T1.BDTR = TIM_BDTR(MOE);
    // Configure PA8 for 1-Wire communication (alternate function open drain)
    PA.CRH |= GPIO_CRH(CNF8_0, CNF8_1, MODE8_1);
}

/**
 * @brief Select which DS18B20 device to measure by its ROM address
 * @param[in] rom Pointer to the 8-byte ROM address (LSB first), or NULL to
 *                return to Skip ROM (broadcast) addressing
 * @note With a non-NULL address, the state machine sends Match ROM (0x55)
 *       plus the device address before each command, so only that device
 *       responds. Pass NULL (or a freshly initialised driver) to keep the
 *       legacy single-sensor Skip ROM behaviour. The address should come from
 *       the non-blocking device search (ds18b20_search_*).
 * @note The selection is applied only between measurement cycles (driver
 *       IDLE). Calls made while a cycle is running are ignored: applying them
 *       mid-cycle would overwrite ctx.addr_cmd while the DMA is still feeding
 *       it, corrupting the in-flight bus transaction. Re-call once the cycle
 *       finished (e.g., from ds18b20_complete(), which the driver invokes
 *       already in the IDLE state).
 */
void ds18b20_select(const uint8_t* rom) {
    if (ctx.current_state != DS18B20_ST_IDLE) {
        // Mid-cycle call - reject to keep the in-flight transaction intact.
        return;
    }
    // Explicit single-device addressing: leave simultaneous-conversion mode.
    ctx.scan_mode = 0;
    if (rom == 0) {
        ctx.address_mode = 0;
        return;
    }
    for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
        ctx.selected_rom[i] = rom[i];
    }
    build_addr_prefix(); // Build the invariant Match ROM prefix once per selection
    ctx.address_mode = 1;
}

/**
 * @brief Check presence and issue command (shared by CONVERT and REQUEST states)
 * @param[in] cmd_byte Command byte to send
 * @param[in] skip_tbl Skip-ROM command table (for broadcast mode)
 * @param[in] next_state State to transition to on success
 */
static void issue_command(uint8_t cmd_byte, const uint8_t* skip_tbl, ds18b20_state_t next_state) {
    if (!check_presence()) {
        // Return to IDLE before the callback so a re-selection from inside
        // ds18b20_complete() is accepted (ds18b20_select() only acts at IDLE).
        ctx.current_state = DS18B20_ST_IDLE;
        // Turn the busy indicator off: busy(1) was set in START and this early
        // exit skips the DECODE state where busy(0) is normally cleared.
        ds18b20_busy(0);
        ds18b20_complete(DS18B20_TEMP_ERROR_NO_SENSOR);
        start_cycle_pause();
        return;
    }
    if (ctx.address_mode) {
        build_addr_cmd(cmd_byte);
        send_command_n(ctx.addr_cmd, DS18B20_MATCH_SLOTS);
    } else {
        send_command(skip_tbl);
    }
    ctx.current_state = next_state;
}

/**
 * @brief Main state machine function - must be called periodically from main loop
 * @note Non-blocking state machine that advances 1-Wire communication state
 * @note Uses timer update interrupt flag to determine when operations complete
 */
void ds18b20_poll(void) {
    // Ownership guard: while the device search or a resolution change owns the
    // timer, the measurement state machine must stay out of the way and not
    // react to their UIFs.
    if (!search_ctx.finished || !res_ctx.finished) {
        return;
    }

    // Check if timer update interrupt occurred (indicates operation completion)
    // This is the non-blocking way to detect when timed operations finish
    if (!(T1.SR & TIM_SR(UIF))) return;
    // Clear timer update interrupt flag
    T1.SR = 0;

    // State machine to manage 1-Wire communication sequence
    switch (ctx.current_state) {
    case DS18B20_ST_IDLE:
        // Initialize union memory (fills with 0xFF pattern)
        ctx.fill_union = (uint64_t)-1;
        // Transition to START state
        ctx.current_state = DS18B20_ST_START;
        /* fallthrough to START state immediately */
        __attribute__((fallthrough));

